app/controllers/beans_controller.rb

SELECT "beans".* FROM "beans"
---
    def index
        render json: Bean.all

SELECT "beans".* FROM "beans" WHERE "beans"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def show
        shop = Bean.find(params[:id])

INSERT INTO "beans" ("origin", "name", "description", "image", "roast", "shop_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["origin", "1"], ["name", "1"], ["description", "1"], ["image", "1"], ["roast", "1"], ["shop_id", 1], ["created_at", "2022-12-09 08:25:54.132076"], ["updated_at", "2022-12-09 08:25:54.132076"]]
---
    def create
        bean = Bean.create!(bean_params)

SELECT "beans".* FROM "beans" WHERE "beans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "beans" WHERE "beans"."id" = ?  [["id", 3]]
---
    def destroy
        bean = Bean.find(params[:id])
        bean.destroy