app/controllers/shops_controller.rb

    def index
        render json: Shop.all
---
SELECT "shops".* FROM "shops"

    def show
        shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        shop = Shop.create!(shop_params)
---
INSERT INTO "shops" ("name", "address", "created_at", "updated_at", "review") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["address", "1"], ["created_at", "2022-12-07 23:24:58.146976"], ["updated_at", "2022-12-07 23:24:58.146976"], ["review", 1]]

    def destroy
        shop = Shop.find(params[:id])
        shop.destroy
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 21]]

    def update
        shop = Shop.find(params[:id])
        if shop
          shop.update(shop_review)
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shops" SET "updated_at" = ?, "review" = ? WHERE "shops"."id" = ?  [["updated_at", "2022-12-08 18:25:45.812397"], ["review", 2], ["id", 1]]