app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Chuck"], ["email", nil], ["password_digest", "[FILTERED]"], ["img", nil], ["created_at", "2022-12-06 16:30:36.559210"], ["updated_at", "2022-12-06 16:30:36.559210"]]